{
  "dashboard": {
    "title": "แดชบอร์ดไททานิค",
    "reload": "โหลดใหม่",
    "clearComments": "ลบความคิดเห็นทั้งหมด",
    "stats": {
      "total": "จำนวนระเบียนทั้งหมด",
      "survived": "รอดชีวิต",
      "notSurvived": "ไม่รอดชีวิต"
    },
    "toasts": {
      "loaded": "โหลด {count} แถวจาก {source}",
      "parseFailed": "อ่านไฟล์ CSV ไม่สำเร็จ",
      "sampleFailed": "โหลดไฟล์ตัวอย่างไม่ได้",
      "cleared": "ลบความคิดเห็นทั้งหมดแล้ว"
    }
  },
  "labels": {
    "male": "ชาย",
    "female": "หญิง",
    "unknown": "ไม่ทราบ",
    "survived": "รอดชีวิต",
    "notSurvived": "ไม่รอดชีวิต",
    "yes": "ใช่",
    "no": "ไม่",
    "importance": "ความสำคัญ",
    "survivalRate": "อัตรารอดชีวิต",
    "averageAge": "อายุเฉลี่ย"
  },
  "tabs": {
    "start": "เริ่มต้นที่นี่",
    "overview": "ภาพรวม",
    "distribution": "การกระจายข้อมูล",
    "survival": "การวิเคราะห์การรอดชีวิต",
    "correlation": "การวิเคราะห์สหสัมพันธ์",
    "insights": "ข้อมูลเชิงลึกเพิ่มเติม"
  },
  "comments": {
    "title": "ความคิดเห็น",
    "placeholder": "เพิ่มความคิดเห็น",
    "add": "เพิ่มความคิดเห็น",
    "edit": "แก้ไข",
    "delete": "ลบ",
    "empty": "ยังไม่มีความคิดเห็น",
    "modalEdit": "แก้ไขความคิดเห็น",
    "save": "บันทึก"
  },
  "charts": {
    "survivalBySex": {
      "title": "การรอดชีวิตตามเพศ",
      "total": "จำนวนระเบียนทั้งหมด: {total}"
    },
    "survivalByClass": { "title": "การรอดชีวิตตามชั้นโดยสาร" },
    "ageDistribution": { "title": "การกระจายอายุ" },
    "sexDistribution": { "title": "สัดส่วนตามเพศ" },
    "overallDonut": { "title": "รอดชีวิตเทียบกับไม่รอด" },
    "survivalRateByAgeGroup": { "title": "อัตรารอดชีวิตตามช่วงอายุ" },
    "correlationHeatmap": { "title": "ฮีทแมประดับสหสัมพันธ์" },
    "pearson": { "title": "ค่าสหสัมพันธ์ของเพียร์สัน" },
    "spearman": { "title": "ค่าสหสัมพันธ์ของสเปียร์แมน" },
    "avgAgeByClass": { "title": "อายุเฉลี่ยตามชั้นโดยสาร" },
    "survivalByClassAndGender": { "title": "การรอดชีวิตตามชั้นโดยสารและเพศ" },
    "survivalWithSibSp": {
      "title": "อัตรารอดชีวิตเมื่อมี/ไม่มีพี่น้องหรือคู่สมรสร่วมเดินทาง"
    },
    "featureImportance": { "title": "ความสำคัญของคุณลักษณะ (โดยประมาณ)" }
  },
  "notes": {
    "start": "ภาพรวมผู้รอด/ไม่รอดทั้งหมด ใช้เพื่อดูภาพใหญ่ก่อนลงรายละเอียด",
    "overviewSex": "เปรียบเทียบจำนวนผู้รอดตามเพศ สีเป็นประเภท ไม่สื่อคุณค่า",
    "overviewClass": "เปรียบเทียบจำนวนผู้รอดตามชั้นโดยสาร โดยทั่วไปชั้นที่สูงกว่ามักรอดมากกว่า",
    "overviewAge": "ฮิสโตแกรมอายุช่วงละ 5 ปี แสดงโพรไฟล์อายุรวม",
    "distributionSex": "องค์ประกอบเพศของชุดข้อมูล (ไม่ใช่การรอด)",
    "distributionAge": "การกระจายอายุของผู้โดยสาร (ไม่ใช่การรอด)",
    "survivalAge": "อัตรารอดชีวิตตามกลุ่มอายุ (คิดเป็นเปอร์เซ็นต์ของกลุ่มนั้น)",
    "heatmap": "ฮีทแมประดับสหสัมพันธ์ระหว่างตัวแปรเชิงตัวเลข",
    "pearson": "ตารางค่าสหสัมพันธ์ของเพียร์สัน ใช้ค่าสัมบูรณ์เพื่อพิจารณาความแรง (±1 แรง, 0 อ่อน)",
    "spearman": "สเปียร์แมนเหมาะกับความสัมพันธ์เชิงอันดับที่ไม่เป็นเส้นตรงหรือมี outlier",
    "avgAgeByClass": "อายุเฉลี่ยต่างกันตามชั้นโดยสาร สะท้อนโครงสร้างประชากร",
    "byClassGender": "จำนวนผู้รอดแยกตามชั้นและเพศ แสดงการให้ความสำคัญ/การเข้าถึง",
    "withSibSp": "เปรียบเทียบอัตรารอดของผู้ที่เดินทางพร้อมพี่น้อง/คู่สมรสกับผู้ที่เดินทางคนเดียว"
  },
  "welcome": {
    "title": "ยินดีต้อนรับสู่ Titanic Dashboard",
    "body": "ยินดีต้อนรับสู่การวิเคราะห์ชุดข้อมูลไททานิค แดชบอร์ดนี้นำเสนอภาพรวมเชิงลึกของผู้โดยสาร ทั้งอัตราการรอดชีพ ข้อมูลประชากร และการกระจายตามชั้นโดยสาร คุณจะพบกราฟและตัวชี้วัดต่าง ๆ เพื่อช่วยทำความเข้าใจชุดข้อมูล เริ่มจากส่วน \"ภาพรวม\" เพื่อดูสถิติและข้อมูลสำคัญ"
  },
  "bullets": {
    "overview1": "- อัตรารอดชีวิตของเพศหญิงประมาณ {femaleRate}% สูงกว่าเพศชายประมาณ {maleRate}% อย่างชัดเจน",
    "overview2": "- เมื่อแบ่งตามชั้นโดยสาร อัตรารอดชีวิตของชั้น 1/2/3 อยู่ที่ {r1}% / {r2}% / {r3}% ตามลำดับ สะท้อนโอกาสเข้าถึงเรือชูชีพ",
    "distribution1": "- การกระจายเพศ: เปรียบเทียบสัดส่วนชาย/หญิงในชุดข้อมูล (ไม่ใช่การรอด)",
    "distribution2": "- การกระจายอายุ: ส่วนใหญ่อยู่ในวัยหนุ่มสาวถึงกลางคน และมีข้อมูลอายุที่ขาดหายบางส่วน",
    "survival1": "- อัตรารอดแตกต่างตามช่วงอายุ กลุ่มอายุน้อยมีแนวโน้มรอดสูงกว่า ขณะที่วัยสูงอายุมีแนวโน้มลดลง",
    "insight1": "- อายุเฉลี่ยมีแนวโน้มลดลงเมื่อชั้นโดยสารต่ำลง สะท้อนโครงสร้างผู้โดยสารที่ต่างกัน",
    "insight2": "- เพศหญิงในทุกชั้นโดยสารมีจำนวนผู้รอดมากกว่าชายอย่างชัดเจน",
    "insight3": "- ผู้ที่เดินทางพร้อมพี่น้อง/คู่สมรสมีอัตรารอดต่างจากผู้ที่เดินทางคนเดียว บ่งชี้บทบาทของเครือข่ายช่วยเหลือ"
  },
  "explain": {
    "corTitle": "การอธิบายเพียร์สันและสเปียร์แมน",
    "corText1": "- เพียร์สันวัดความสัมพันธ์เชิงเส้น ค่าใกล้ +1/−1 คือความสัมพันธ์เชิงเส้นที่เข้มแข็ง บวก/ลบ ตามลำดับ ค่าใกล้ 0 คืออ่อน/ไม่มี",
    "corText2": "- สเปียร์แมน (เชิงอันดับ) เหมาะกับความสัมพันธ์เชิงเดี่ยวที่ไม่เป็นเส้นตรงหรือมี outlier มาก"
  }
}
